##### 1

In [76]:
import pandas as pd
import numpy as np

##### 2

In [77]:
df = pd.read_csv('baseball_shop.csv')
print(df.shape)
print(df.info())
display(df.head())

(376, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ShopID   376 non-null    int64
 1   Pref     376 non-null    object
 2   Product  376 non-null    object
 3   Price    376 non-null    int64
 4   Amount   376 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.8+ KB
None

   ShopID      Pref  Product  Price  Amount
0      18  Kanagawa      BAT  13800      10
1      18  Kanagawa  UNIFORM  11800      12
2      18  Kanagawa    GLOVE  16700      10
3      18  Kanagawa    SHOES  12800      10
4      30   Ibaraki      BAT  13800       8

##### 3

In [78]:
df['Pref'].value_counts()

Tokyo       68
Kanagawa    68
Chiba       64
Saitama     48
Ibaraki     48
Gunma       40
Tochigi     40
Name: Pref, dtype: int64

##### 4

In [79]:
print("Number of shops:",len(df['ShopID'].value_counts()))

Number of shops: 94

##### 5

In [80]:
df['Sales'] = df['Price']*df['Amount'] 
df.head()

   ShopID      Pref  Product  Price  Amount   Sales
0      18  Kanagawa      BAT  13800      10  138000
1      18  Kanagawa  UNIFORM  11800      12  141600
2      18  Kanagawa    GLOVE  16700      10  167000
3      18  Kanagawa    SHOES  12800      10  128000
4      30   Ibaraki      BAT  13800       8  110400

##### 6

In [81]:
display(df.groupby('ShopID').sum())
print("total of the day:",df.groupby('ShopID').sum()['Sales'].sum())

        Price  Amount   Sales
ShopID
1       55100      20  264700
2       55100      20  294100
3       55100      11  148500
4       55100      16  215600
5       55100      24  346200
...       ...     ...     ...
90      55100      45  620400
91      55100      24  329600
92      55100      24  319800
93      55100      27  368100
94      55100      32  439800

[94 rows x 3 columns]

total of the day: 37283200

##### 7

In [82]:
df_pref=df.groupby('Pref').sum()
print(df_pref['Sales'])

Pref
Chiba       5343100
Gunma       4021000
Ibaraki     4513500
Kanagawa    5813100
Saitama     5276800
Tochigi     3296300
Tokyo       9019400
Name: Sales, dtype: int64

##### 8

In [83]:
print(df_pref['Sales'].idxmin())

Tochigi

##### 9

In [84]:
df_uniform_chiba = df[(df['Product']=='UNIFORM') & (df['Pref']=='Chiba')]
print("Total UNIFORM sales in Chiba: ", df_uniform_chiba['Sales'].sum())
display(df.groupby(['Pref','Product']).sum()['Sales'])

Total UNIFORM sales in Chiba:  1534000

Pref      Product
Chiba     BAT         966000
          GLOVE      1486300
          SHOES      1356800
          UNIFORM    1534000
Gunma     BAT         938400
          GLOVE      1402800
          SHOES       960000
          UNIFORM     719800
Ibaraki   BAT        1090200
          GLOVE      1152300
          SHOES      1126400
          UNIFORM    1144600
Kanagawa  BAT        1297200
          GLOVE      1619900
          SHOES      1574400
          UNIFORM    1321600
Saitama   BAT        1228200
          GLOVE      1503000
          SHOES      1318400
          UNIFORM    1227200
Tochigi   BAT         759000
          GLOVE       718100
          SHOES       780800
          UNIFORM    1038400
Tokyo     BAT        2166600
          GLOVE      2839000
          SHOES      2137600
          UNIFORM    1876200
Name: Sales, dtype: int64

##### 10

In [85]:
df.groupby(['Pref','ShopID']).mean()[['Amount','Sales']]

              Amount     Sales
Pref  ShopID
Chiba 1         5.00   66175.0
      3         2.75   37125.0
      7         7.25  100350.0
      14        7.50  105500.0
      21        8.75  115850.0
...              ...       ...
Tokyo 49       33.50  455650.0
      73       10.75  155900.0
      86       11.75  163575.0
      90       11.25  155100.0
      94        8.00  109950.0

[94 rows x 2 columns]

##### 10

In [88]:
df['Product'] = df['Product'].str.lower()
df.head()

   ShopID      Pref  Product  Price  Amount   Sales
0      18  Kanagawa      bat  13800      10  138000
1      18  Kanagawa  uniform  11800      12  141600
2      18  Kanagawa    glove  16700      10  167000
3      18  Kanagawa    shoes  12800      10  128000
4      30   Ibaraki      bat  13800       8  110400